
&НаСервереБезКонтекста
Процедура ЗаполнитьЕдиницыИзмеренияПредопределеннымиДаннымиНаСервере()
	Справочники.ЕдиницыИзмерения.ЗаполнитьДаннымиИзМакета();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЕдиницыИзмеренияПредопределеннымиДанными(Команда)
	ЗаполнитьЕдиницыИзмеренияПредопределеннымиДаннымиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВидыУслугПредопределеннымиДанными(Команда)
	ЗаполнитьВидыУслугПредопределеннымиДаннымиНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьВидыУслугПредопределеннымиДаннымиНаСервере()
	Справочники.ВидыУслуг.ЗаполнитьДаннымиИзМакета();
КонецПроцедуры
