#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Настройки(Команда)
	Элементы.ГруппаСтраницыОтчета.ТекущаяСтраница = Элементы.ГруппаНастройки;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Элементы.ГруппаСтраницыОтчета.ТекущаяСтраница = Элементы.ГруппаОтчет;
	СформироватьНаСервере("Основной", ТабличныйДокумент);
КонецПроцедуры

&НаКлиенте
Процедура ПостроитьДиаграмму(Команда)
	Элементы.ГруппаСтраницыОтчета.ТекущаяСтраница = Элементы.ГруппаДиаграмма;
	СформироватьНаСервере("Диаграмма", Диаграмма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере(ВариантНастроек, ТабличныйДокументВывода)
	
	Отборы = Новый Структура;
	Отборы.Вставить("НачалоПериода", Период.ДатаНачала);
	Отборы.Вставить("КонецПериода", Период.ДатаОкончания);
	Отборы.Вставить("ВидУслуг", ВидУслуг);
		
	СКД = Обработки.Отчеты.ПолучитьМакет("ФиксацияКоммунальныхУслуг");
	Настройки = СКД.ВариантыНастроек[ВариантНастроек].Настройки;
	
	РаботаСОтчетами.ЗаполнитьПараметрыДанных(Настройки, Отборы);
	РаботаСОтчетами.ЗаполнитьДополнительныеОтборы(Настройки, Отборы);
	РаботаСОтчетами.СформироватьОтчет(СКД, Настройки, ТабличныйДокументВывода);
	
КонецПроцедуры

#КонецОбласти