#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьДаннымиИзМакета()Экспорт
	
	Макет = Справочники.ВидыУслуг.ПолучитьМакет("ЗаполнениеПредопределенныхЭлементов");
	КолонкиМакета = СтруктураСоответствияКолонокМакетаРеквизитам();
	НомерСтроки = 2;
	Пока Истина Цикл
		
		ИмяПредопределенногоЭлемента = Макет.Область("R" + НомерСтроки + "C1").Текст;
		Если Не ЗначениеЗаполнено(ИмяПредопределенногоЭлемента) Тогда
			Прервать;	
		КонецЕсли;
		
		ЭлементСправочника = Справочники.ВидыУслуг[ИмяПредопределенногоЭлемента];
		ОбъектСправочника = ЭлементСправочника.ПолучитьОбъект();
		
		Для Каждого КолонкаМакета Из КолонкиМакета Цикл
			ОбъектСправочника[КолонкаМакета.Ключ] = Макет.Область("R" + НомерСтроки + КолонкаМакета.Значение).Текст;	
		КонецЦикла;
		
		КодЕдиницыИзмерения = Макет.Область("R" + НомерСтроки + "C6").Текст;
		Если ЗначениеЗаполнено(КодЕдиницыИзмерения) Тогда
			ЕдиницИзмеренияСсылка = Справочники.ЕдиницыИзмерения.НайтиПоКоду(КодЕдиницыИзмерения, Истина);
			Если ЗначениеЗаполнено(ЕдиницИзмеренияСсылка) Тогда
				ОбъектСправочника.ЕдиницаИзмерения = ЕдиницИзмеренияСсылка;	
			КонецЕсли;			
		КонецЕсли;		 
		
		ОбъектСправочника.Записать();
		
		НомерСтроки = НомерСтроки + 1;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеМетоды

Функция СтруктураСоответствияКолонокМакетаРеквизитам()
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", "C2");
	Результат.Вставить("ПоСчетчику", "C3");
	Результат.Вставить("ФиксированнаяСумма", "C4");
	Результат.Вставить("ПроизвольнаяСумма", "C5");;
	Возврат Результат;
	
КонецФункции


#КонецОбласти